package org.polaris2023.msp_rigid_body.ffm;

import java.lang.foreign.Arena;
import java.lang.foreign.FunctionDescriptor;
import java.lang.foreign.Linker;
import java.lang.foreign.MemoryLayout;
import java.lang.foreign.MemorySegment;
import java.lang.foreign.SegmentAllocator;
import java.lang.foreign.SymbolLookup;
import java.lang.foreign.ValueLayout;
import java.lang.invoke.MethodHandle;
import java.nio.file.Path;

public final class RigidBodyFfm {
    public static final MemoryLayout BOOL = MemoryLayout.structLayout(ValueLayout.JAVA_BYTE.withName("_0"));
    public static final MemoryLayout VEC3 = MemoryLayout.structLayout(
            ValueLayout.JAVA_DOUBLE.withName("x"),
            ValueLayout.JAVA_DOUBLE.withName("y"),
            ValueLayout.JAVA_DOUBLE.withName("z"));
    public static final MemoryLayout QUAT = MemoryLayout.structLayout(
            ValueLayout.JAVA_DOUBLE.withName("i"),
            ValueLayout.JAVA_DOUBLE.withName("j"),
            ValueLayout.JAVA_DOUBLE.withName("k"),
            ValueLayout.JAVA_DOUBLE.withName("w"));
    public static final MemoryLayout AABB = MemoryLayout.structLayout(
            VEC3.withName("mins"),
            VEC3.withName("maxs"));
    public static final MemoryLayout SPHERE = MemoryLayout.structLayout(
            VEC3.withName("center"),
            ValueLayout.JAVA_DOUBLE.withName("radius"));
    public static final MemoryLayout OBB = MemoryLayout.structLayout(
            VEC3.withName("center"),
            VEC3.withName("half_extents"),
            QUAT.withName("rotation"));
    public static final MemoryLayout SHAPE_DESC = MemoryLayout.structLayout(
            ValueLayout.JAVA_INT.withName("shape_type"),
            MemoryLayout.paddingLayout(4),
            ValueLayout.JAVA_DOUBLE.withName("a"),
            ValueLayout.JAVA_DOUBLE.withName("b"),
            ValueLayout.JAVA_DOUBLE.withName("c"),
            ValueLayout.JAVA_DOUBLE.withName("d"));
    public static final MemoryLayout INTERACTION_GROUPS = MemoryLayout.structLayout(
            ValueLayout.JAVA_INT.withName("memberships"),
            ValueLayout.JAVA_INT.withName("filter"));
    public static final MemoryLayout QUERY_FILTER = MemoryLayout.structLayout(
            ValueLayout.JAVA_INT.withName("flags"),
            INTERACTION_GROUPS.withName("groups"),
            BOOL.withName("use_groups"),
            MemoryLayout.paddingLayout(3),
            ValueLayout.JAVA_LONG.withName("exclude_collider"),
            BOOL.withName("use_exclude_collider"),
            MemoryLayout.paddingLayout(7),
            ValueLayout.JAVA_LONG.withName("exclude_rigid_body"),
            BOOL.withName("use_exclude_rigid_body"),
            MemoryLayout.paddingLayout(7));
    public static final MemoryLayout VOXEL_OPTIONS = MemoryLayout.structLayout(
            ValueLayout.JAVA_INT.withName("mode"),
            ValueLayout.JAVA_BYTE.withName("dynamic_body"),
            MemoryLayout.paddingLayout(3),
            ValueLayout.JAVA_INT.withName("small_voxel_limit"),
            ValueLayout.JAVA_INT.withName("mesh_voxel_limit"));
    public static final MemoryLayout VOXEL_STATS = MemoryLayout.structLayout(
            ValueLayout.JAVA_INT.withName("cell_count"),
            ValueLayout.JAVA_INT.withName("solid_count"),
            ValueLayout.JAVA_INT.withName("selected_mode"),
            ValueLayout.JAVA_INT.withName("estimated_parts"),
            ValueLayout.JAVA_INT.withName("estimated_vertices"),
            ValueLayout.JAVA_INT.withName("estimated_triangles"),
            ValueLayout.JAVA_INT.withName("size_x"),
            ValueLayout.JAVA_INT.withName("size_y"),
            ValueLayout.JAVA_INT.withName("size_z"));
    public static final MemoryLayout RAY_HIT = MemoryLayout.structLayout(
            ValueLayout.JAVA_LONG.withName("collider"),
            ValueLayout.JAVA_DOUBLE.withName("time_of_impact"),
            VEC3.withName("normal"),
            ValueLayout.JAVA_INT.withName("feature"),
            MemoryLayout.paddingLayout(4));
    public static final MemoryLayout POINT_PROJECTION = MemoryLayout.structLayout(
            VEC3.withName("point"),
            BOOL.withName("is_inside"),
            MemoryLayout.paddingLayout(7));
    public static final MemoryLayout SHAPE_CAST_OPTIONS = MemoryLayout.structLayout(
            ValueLayout.JAVA_DOUBLE.withName("max_time_of_impact"),
            ValueLayout.JAVA_DOUBLE.withName("target_distance"),
            BOOL.withName("stop_at_penetration"),
            BOOL.withName("compute_impact_geometry_on_penetration"),
            MemoryLayout.paddingLayout(6));
    public static final MemoryLayout SHAPE_CAST_HIT = MemoryLayout.structLayout(
            ValueLayout.JAVA_LONG.withName("collider"),
            ValueLayout.JAVA_DOUBLE.withName("time_of_impact"),
            VEC3.withName("witness1"),
            VEC3.withName("witness2"),
            VEC3.withName("normal1"),
            VEC3.withName("normal2"),
            ValueLayout.JAVA_INT.withName("status"),
            MemoryLayout.paddingLayout(4));
    public static final MemoryLayout COLLISION_EVENT = MemoryLayout.structLayout(
            BOOL.withName("started"),
            MemoryLayout.paddingLayout(7),
            ValueLayout.JAVA_LONG.withName("collider1"),
            ValueLayout.JAVA_LONG.withName("collider2"),
            BOOL.withName("sensor"),
            BOOL.withName("removed"),
            MemoryLayout.paddingLayout(6));
    public static final MemoryLayout CONTACT_FORCE_EVENT = MemoryLayout.structLayout(
            ValueLayout.JAVA_LONG.withName("collider1"),
            ValueLayout.JAVA_LONG.withName("collider2"),
            VEC3.withName("total_force"),
            ValueLayout.JAVA_DOUBLE.withName("total_force_magnitude"),
            VEC3.withName("max_force_direction"),
            ValueLayout.JAVA_DOUBLE.withName("max_force_magnitude"));
    public static final MemoryLayout AERO_REPORT = MemoryLayout.structLayout(
            VEC3.withName("total_force"),
            VEC3.withName("total_torque"),
            ValueLayout.JAVA_INT.withName("surface_count"),
            ValueLayout.JAVA_INT.withName("active_surface_count"));
    public static final MemoryLayout HOHMANN_TRANSFER = MemoryLayout.structLayout(
            ValueLayout.JAVA_DOUBLE.withName("delta_v1"),
            ValueLayout.JAVA_DOUBLE.withName("delta_v2"),
